# InsufficientResourcesException Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsufficientResourcesException Class
Members See Also
---
The exception that is thrown when the OS runs out of resources, e.g. memory, disk space, or USER or GDI objects.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class InsufficientResourcesException : InvalidOperationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class InsufficientResourcesException _
	Inherits InvalidOperationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class InsufficientResourcesException : public InvalidOperationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..InvalidOperationException Autodesk.Revit.Exceptions..::..InsufficientResourcesException
# See Also
InsufficientResourcesException Members
Autodesk.Revit.Exceptions Namespace